In [263]:
from bs4 import BeautifulSoup as bsoup
import urllib.robotparser
import requests
import time
import pandas as pd
import re

In [265]:
# daily revenue for movie industry, contains data for the top grossing movie by day with associated revenue
# test run: goes to url and pulls all data for 1 month

url = "https://www.boxofficemojo.com/daily/2019/?interval=january&sort=date&sortDir=asc&view=month&ref_=bo_di__resort#table"
page = requests.get(url)
soup = bsoup(page.text, 'lxml')

all_divs = soup.main.find_all("div", id="table")
all_tables = all_divs[0].find_all("table")
all_trs = all_tables[0].find_all("tr")

for i in range(1, len(all_trs)):
    print(f"Entry row {i} = ")
    
    all_tds = all_trs[i].find_all("td")
    entry = []
    
    for j in range(0, len(all_tds)):
        entry.append(all_tds[j].text)       
    
    print(entry)

Entry row 1 =
["Jan 1, 2019New Year's Day", 'Tuesday', '1', '$52,588,390', '-0.3%', '+23.3%', '53', 'Aquaman', '$16,377,779']
Entry row 2 =
['Jan 2, 2019', 'Wednesday', '2', '$25,043,176', '-52.4%', '-54.9%', '53', 'Aquaman', '$7,379,476']
Entry row 3 =
['Jan 3, 2019', 'Thursday', '3', '$22,001,708', '-12.1%', '-57.4%', '55', 'Aquaman', '$6,203,801']
Entry row 4 =
['Jan 4, 2019', 'Friday', '4', '$38,870,140', '+76.7%', '-31.4%', '52', 'Aquaman', '$9,388,082']
Entry row 5 =
['Jan 5, 2019', 'Saturday', '5', '$48,843,884', '+25.7%', '-16%', '52', 'Aquaman', '$13,053,690']
Entry row 6 =
['Jan 6, 2019', 'Sunday', '6', '$31,293,715', '-35.9%', '-38.6%', '52', 'Aquaman', '$8,561,508']
Entry row 7 =
['Jan 7, 2019', 'Monday', '7', '$9,979,794', '-68.1%', '-72.5%', '48', 'Aquaman', '$2,583,295']
Entry row 8 =
['Jan 8, 2019', 'Tuesday', '8', '$14,364,595', '+43.9%', '-72.7%', '50', 'Aquaman', '$3,852,619']
Entry row 9 =
['Jan 9, 2019', 'Wednesday', '9', '$9,403,436', '-34.5%', '-62.5%', '50', 'Aquaman', '$2,134,441']
Entry row 10 =
['Jan 10, 2019', 'Thursday', '10', '$8,098,409', '-13.9%', '-63.2%', '48', 'Aquaman', '$2,002,266']
Entry row 11 =
['Jan 11, 2019', 'Friday', '11', '$28,100,212', '+247%', '-27.7%', '51', 'The Upside', '$6,928,354']
Entry row 12 =
['Jan 12, 2019', 'Saturday', '12', '$41,458,012', '+47.5%', '-15.1%', '52', 'The Upside', '$7,864,742']
Entry row 13 =
['Jan 13, 2019', 'Sunday', '13', '$27,281,866', '-34.2%', '-12.8%', '52', 'The Upside', '$5,561,904']
Entry row 14 =
['Jan 14, 2019', 'Monday', '14', '$7,718,033', '-71.7%', '-22.7%', '48', 'The Upside', '$1,752,184']
Entry row 15 =
['Jan 15, 2019', 'Tuesday', '15', '$12,473,769', '+61.6%', '-13.2%', '49', 'The Upside', '$2,834,401']
Entry row 16 =
['Jan 16, 2019', 'Wednesday', '16', '$14,180,577', '+13.7%', '+50.8%', '48', 'Dragon Ball Super: Broly', '$7,043,068']
Entry row 17 =
['Jan 17, 2019', 'Thursday', '17', '$9,956,091', '-29.8%', '+22.9%', '49', 'Dragon Ball Super: Broly', '$3,376,374']
Entry row 18 =
['Jan 18, 2019', 'Friday', '18', '$33,442,056', '+235.9%', '+19%', '50', 'Glass', '$15,886,745']
Entry row 19 =
['Jan 19, 2019', 'Saturday', '19', '$44,908,041', '+34.3%', '+8.3%', '49', 'Glass', '$14,524,105']
Entry row 20 =
['Jan 20, 2019', 'Sunday', '20', '$31,173,062', '-30.6%', '+14.3%', '49', 'Glass', '$9,918,070']
Entry row 21 =
['Jan 21, 2019MLK Day', 'Monday', '21', '$26,640,078', '-10.3%', '+11.6%', '51', 'Glass', '$6,176,030']
Entry row 22 =
['Jan 22, 2019', 'Tuesday', '22', '$11,717,186', '-56%', '-6.1%', '48', 'Glass', '$3,814,910']
Entry row 23 =
['Jan 23, 2019', 'Wednesday', '23', '$7,111,194', '-39.3%', '-49.9%', '49', 'Glass', '$2,144,560']
Entry row 24 =
['Jan 24, 2019', 'Thursday', '24', '$7,135,530', '+0.3%', '-28.3%', '51', 'Glass', '$2,076,715']
Entry row 25 =
['Jan 25, 2019', 'Friday', '25', '$18,913,633', '+165.1%', '-43.4%', '51', 'Glass', '$4,963,595']
Entry row 26 =
['Jan 26, 2019', 'Saturday', '26', '$35,370,112', '+87%', '-21.2%', '53', 'Glass', '$8,652,565']
Entry row 27 =
['Jan 27, 2019', 'Sunday', '27', '$21,167,825', '-40.2%', '-32.1%', '53', 'Glass', '$5,268,280']
Entry row 28 =
['Jan 28, 2019', 'Monday', '28', '$5,011,938', '-76.3%', '-81.2%', '56', 'Glass', '$1,310,025']
Entry row 29 =
['Jan 29, 2019', 'Tuesday', '29', '$7,751,898', '+54.7%', '-33.8%', '55', 'Glass', '$1,941,805']
Entry row 30 =
['Jan 30, 2019', 'Wednesday', '30', '$5,355,391', '-30.9%', '-24.7%', '55', 'Glass', '$1,205,830']
Entry row 31 =
['Jan 31, 2019', 'Thursday', '31', '$5,554,041', '+3.7%', '-22.2%', '56', 'Glass', '$1,236,865']

In [266]:
# daily revenue for movie industry, contains data for the top grossing movie by day with associated revenue
# this will run through all months and the past 4 years worth of data on boxofficemojo.com to gather the revenue data
# the result is a data frame with the top grossing movie by day for the past 4 years


months = ["january","february","march","april","may","june","july","august","september", "october", "november", "december"]
years = ["2017","2018","2019","2020"]

column_names = ["date_full","weekday","day_number","top_10_gross_total","ytd_delta",
                "lw_delta","releases","top_release","top_gross"]

df = pd.DataFrame(columns=column_names)

print("running")

for year in years:
    for month in months:
        url_a = "https://www.boxofficemojo.com/daily/"
        url_b = year
        url_c = "/?interval="
        url_d = month
        url_e = "&sort=date&sortDir=asc&view=month&ref_=bo_di__resort#table"

        url = url_a + url_b + url_c + url_d + url_e
        page = requests.get(url)
        soup = bsoup(page.text, 'lxml')
        current_month = []

        all_divs = soup.main.find_all("div", id="table")
        all_tables = all_divs[0].find_all("table")
        all_trs = all_tables[0].find_all("tr")

        for i in range(1, len(all_trs)):
            all_tds = all_trs[i].find_all("td")
            entry = []
            for j in range(0, len(all_tds)):
                entry.append(all_tds[j].text)
            current_month.append(entry)

        df_month = pd.DataFrame(current_month, columns=column_names)
        frames = [df, df_month]
        df = pd.concat(frames)
        
        time.sleep(0.1)
        
    print(f"{year} processed...")
    
df.reset_index(inplace=True)
df.drop(["index", "ytd_delta", "lw_delta"], axis = 1, inplace = True)
print("complete")

running
2017 processed...
2018 processed...
2019 processed...
2020 processed...
complete

In [267]:
df.head(10)

,date_full,weekday,day_number,top_10_gross_total,releases,top_release,top_gross
0,"Jan 1, 2017New Year's Day",Sunday,1,"$56,752,913",52,Rogue One: A Star Wars Story,"$16,751,857"
1,"Jan 2, 2017",Monday,2,"$54,065,844",54,Rogue One: A Star Wars Story,"$15,913,674"
2,"Jan 3, 2017",Tuesday,3,"$24,799,823",48,Rogue One: A Star Wars Story,"$6,268,921"
3,"Jan 4, 2017",Wednesday,4,"$16,695,754",49,Rogue One: A Star Wars Story,"$4,237,535"
4,"Jan 5, 2017",Thursday,5,"$14,928,109",50,Rogue One: A Star Wars Story,"$3,893,517"
5,"Jan 6, 2017",Friday,6,"$35,952,754",46,Hidden Figures,"$7,621,334"
6,"Jan 7, 2017",Saturday,7,"$50,026,406",44,Rogue One: A Star Wars Story,"$9,558,458"
7,"Jan 8, 2017",Sunday,8,"$34,512,473",45,Rogue One: A Star Wars Story,"$6,420,138"
8,"Jan 9, 2017",Monday,9,"$10,419,513",46,Hidden Figures,"$1,857,416"
9,"Jan 10, 2017",Tuesday,10,"$15,267,153",44,Hidden Figures,"$2,877,410"

In [268]:
# cleaning up the revenue values

df['top_10_gross_total'] = df['top_10_gross_total'].str.replace("$", "")
df['top_10_gross_total'] = df['top_10_gross_total'].str.replace(",", "")
df['top_gross'] = df['top_gross'].str.replace("$", "")
df['top_gross'] = df['top_gross'].str.replace(",", "")

df.head()

,date_full,weekday,day_number,top_10_gross_total,releases,top_release,top_gross
0,"Jan 1, 2017New Year's Day",Sunday,1,56752913,52,Rogue One: A Star Wars Story,16751857
1,"Jan 2, 2017",Monday,2,54065844,54,Rogue One: A Star Wars Story,15913674
2,"Jan 3, 2017",Tuesday,3,24799823,48,Rogue One: A Star Wars Story,6268921
3,"Jan 4, 2017",Wednesday,4,16695754,49,Rogue One: A Star Wars Story,4237535
4,"Jan 5, 2017",Thursday,5,14928109,50,Rogue One: A Star Wars Story,3893517

In [269]:
# cleaning up the date column, adding a new columns for month, day, year, and event (holiday)

dates = df[['date_full']]
holiday = pd.DataFrame(columns = ["date", "year", "event", "month", "day"])
holiday[["date", "year", "event"]] = dates.date_full.str.split('(\d{4})', expand = True)
holiday['date'] = holiday['date'].str.replace(",", "")
holiday[["month", "day"]] = holiday.date.str.split(' ', n= 1, expand = True)
final = holiday[['month', 'day', 'year', 'event']]

final.head()

  month day  year           event
0   Jan  1   2017  New Year's Day
1   Jan  2   2017
2   Jan  3   2017
3   Jan  4   2017
4   Jan  5   2017

In [270]:
# update date columns using new dataframe from above

df[['month', 'day', 'year', 'event']] = final[['month', 'day', 'year', 'event']]
df.drop(["date_full"], axis = 1, inplace = True)

In [271]:
df.to_csv("movie_data_v1.csv")
df.head()

,weekday,day_number,top_10_gross_total,releases,top_release,top_gross,month,day,year,event
0,Sunday,1,56752913,52,Rogue One: A Star Wars Story,16751857,Jan,1,2017,New Year's Day
1,Monday,2,54065844,54,Rogue One: A Star Wars Story,15913674,Jan,2,2017,
2,Tuesday,3,24799823,48,Rogue One: A Star Wars Story,6268921,Jan,3,2017,
3,Wednesday,4,16695754,49,Rogue One: A Star Wars Story,4237535,Jan,4,2017,
4,Thursday,5,14928109,50,Rogue One: A Star Wars Story,3893517,Jan,5,2017,